IdeaRS.OpenModel.Detail.Loading.TypeLinePosition
type position line support

IdeaRS.OpenModel.Detail.Loading.TypeLinePosition.Point
on point (0, 0) or selected point

IdeaRS.OpenModel.Detail.Loading.TypeLinePosition.OnWallEdge
on wall edge

IdeaRS.OpenModel.Detail.Loading.TypeLinePosition.Polyline
polyline